linuxhelp01/Esp32_paletizador/src/machine.cpp
#include "machine.h"

#include "config.h"
#include "mks_can.h"

#include <ESP32Servo.h>

#if ENABLE_MICRO_ROS
struct NullDebugSerial {
  template <typename... Args>
  void print(Args...) {}

  template <typename... Args>
  void println(Args...) {}
};

static NullDebugSerial DebugSerial;
#else
#define DebugSerial Serial
#endif

MotorNode motors[ROBOT_MOTOR_COUNT] = {
  MotorNode("X1", CAN_ID_PHYSICAL_Y1, MOTOR_DIR_PHYSICAL_Y1),
  MotorNode("X2", CAN_ID_PHYSICAL_Y2, MOTOR_DIR_PHYSICAL_Y2),
  MotorNode("Y", CAN_ID_PHYSICAL_X, MOTOR_DIR_PHYSICAL_X),
  MotorNode("Z", CAN_ID_Z, MOTOR_DIR_Z),
  MotorNode("A", CAN_ID_A, MOTOR_DIR_A, true),
};

static uint32_t lastEncoderPollMs[ROBOT_MOTOR_COUNT] = {};
static uint32_t lastSpeedPollMs = 0;
static uint32_t lastRawEncoderPollMs = 0;
static uint32_t lastAngleErrorPollMs = 0;
static uint32_t lastHomeStatusPollMs = 0;
static uint32_t lastEnableStatusPollMs = 0;
static uint32_t lastStallStatusPollMs = 0;
static uint32_t encoderPollingPausedUntilMs = 0;
static uint8_t nextSpeedPollMotor = 0;
static uint8_t nextRawEncoderPollMotor = 0;
static uint8_t nextAngleErrorPollMotor = 0;
static uint8_t nextEnablePollMotor = 0;
static uint8_t nextStallPollMotor = 0;
static bool safetyFaultActive = false;
static const char *safetyFaultReason = "OK";
static bool xPairMotionMonitoringActive = false;
static int8_t xPairExpectedDirection = 0;

static bool commandStopAll();
static void serviceAuxServoTestSweep();

static bool motorIsTelemetryActive(const MotorNode &motor, uint32_t now);

static constexpr uint8_t NO_MOTOR_SLOT = 0xFF;
static constexpr uint8_t ENCODER_SLOT_WIDTH = 2;

// Slot de 20 ms para que la telemetria critica no dependa del orden de los if.
// X1/X2: 250 Hz por motor; Y/Z: 200 Hz; A: 50 Hz idle, ~200 Hz activo.
static constexpr uint8_t ENCODER_POLL_SLOTS[CAN_POLL_SLOT_COUNT][ENCODER_SLOT_WIDTH] = {
  {0, NO_MOTOR_SLOT}, {1, 4},             {2, NO_MOTOR_SLOT}, {3, NO_MOTOR_SLOT},
  {0, NO_MOTOR_SLOT}, {1, NO_MOTOR_SLOT}, {4, NO_MOTOR_SLOT}, {2, NO_MOTOR_SLOT},
  {0, 3},             {1, NO_MOTOR_SLOT}, {NO_MOTOR_SLOT, NO_MOTOR_SLOT}, {4, NO_MOTOR_SLOT},
  {0, 2},             {1, 3},             {NO_MOTOR_SLOT, NO_MOTOR_SLOT}, {NO_MOTOR_SLOT, NO_MOTOR_SLOT},
  {0, 4},             {1, 2},             {3, NO_MOTOR_SLOT},             {NO_MOTOR_SLOT, NO_MOTOR_SLOT},
};

static constexpr bool ENCODER_SLOT_A_REQUIRES_ACTIVITY[CAN_POLL_SLOT_COUNT] = {
  false, true,  false, false, false, false, false, false, false, false,
  false, true,  false, false, false, false, true,  false, false, false,
};

struct CanPollBudget {
  uint8_t used = 0;

  bool available() const {
    return used < ENCODER_MAX_REQUESTS_PER_CONTROL_CYCLE;
  }

  bool request(bool (*fn)(const MotorNode &), const MotorNode &motor) {
    if (!available()) return false;
    if (!fn(motor)) return false;
    used++;
    return true;
  }
};

struct AxisLimitState {
  bool configured = false;
  float minMm = 0.0f;
  float maxMm = 0.0f;
};

enum class HomingPhase : uint8_t {
  IDLE,
  CONFIG_FAST,
  START_FAST,
  WAIT_FAST,
  CONFIG_SLOW,
  START_SLOW,
  WAIT_SLOW,
  COMPLETE,
  FAILED,
};

struct HomingSequenceState {
  bool active = false;
  Axis requestedAxis = Axis::UNKNOWN;
  Axis axes[4] = {Axis::UNKNOWN, Axis::UNKNOWN, Axis::UNKNOWN, Axis::UNKNOWN};
  uint8_t axisCount = 0;
  uint8_t axisIndex = 0;
  HomingPhase phase = HomingPhase::IDLE;
  uint16_t fastRpm = HOME_FAST_RPM;
  uint16_t slowRpm = HOME_SLOW_RPM;
  uint32_t phaseStartedMs = 0;
  bool configureLimits = false;
  float limitMinMm = 0.0f;
  float limitMaxMm = 0.0f;
  char stateText[48] = "idle";
};

static AxisLimitState axisLimits[ROBOT_LINEAR_AXIS_COUNT];
static HomingSequenceState homing;
static bool auxServoEnabled = false;
static uint16_t auxServoPulseUs = AUX_SERVO_CENTER_US;
static float auxServoAngleDeg = 90.0f;
static uint32_t lastAuxServoTestSweepMs = 0;
static bool auxServoTestSweepHigh = false;
static Servo auxServo;
static bool auxServoAttached = false;

static String nextToken(String &line) {
  line.trim();
  const int idx = line.indexOf(' ');
  if (idx < 0) {
    String token = line;
    line = "";
    token.trim();
    return token;
  }

  String token = line.substring(0, idx);
  line = line.substring(idx + 1);
  token.trim();
  return token;
}

static int8_t axisLimitIndex(Axis axis) {
  switch (axis) {
    case Axis::X:
      return 0;
    case Axis::Y:
      return 1;
    case Axis::Z:
      return 2;
    default:
      return -1;
  }
}

static Axis currentHomingAxis() {
  if (!homing.active || homing.axisIndex >= homing.axisCount) return Axis::UNKNOWN;
  return homing.axes[homing.axisIndex];
}

static const char *axisName(Axis axis) {
  switch (axis) {
    case Axis::X:
      return "X";
    case Axis::X1:
      return "X1";
    case Axis::X2:
      return "X2";
    case Axis::Y:
      return "Y";
    case Axis::Z:
      return "Z";
    case Axis::A:
      return "A";
    case Axis::ALL:
      return "ALL";
    default:
      return "?";
  }
}

static uint8_t motorIndex(const MotorNode &motor) {
  for (uint8_t i = 0; i < ROBOT_MOTOR_COUNT; i++) {
    if (&motors[i] == &motor) return i;
  }
  return 0;
}

static bool axisIncludesMotor(Axis axis, uint8_t motorIndex) {
  switch (axis) {
    case Axis::X:
      return motorIndex == 0 || motorIndex == 1;
    case Axis::X1:
      return motorIndex == 0;
    case Axis::X2:
      return motorIndex == 1;
    case Axis::Y:
      return motorIndex == 2;
    case Axis::Z:
      return motorIndex == 3;
    case Axis::A:
      return motorIndex == 4;
    case Axis::ALL:
      return motorIndex < 4;
    default:
      return false;
  }
}

static bool motorIsTelemetryActive(const MotorNode &motor, uint32_t now) {
  const uint8_t index = motorIndex(motor);
  if (motor.moveStatus != 0) return true;
  if (fabsf(motor.velocityMmS) > 0.01f) return true;
  if (homing.active && axisIncludesMotor(currentHomingAxis(), index)) return true;
  return motor.lastSeenMs > 0 && now - motor.lastSeenMs < 250;
}

static uint8_t homeDirectionForMotor(const MotorNode &motor) {
  switch (motorIndex(motor)) {
    case 0:
      return HOME_DIRECTION_X1;
    case 1:
      return HOME_DIRECTION_X2;
    case 2:
      return HOME_DIRECTION_Y;
    case 3:
      return HOME_DIRECTION_Z;
    default:
      return HOME_DIRECTION_A;
  }
}

static MotorNode *findMotorById(uint16_t canId) {
  for (MotorNode &motor : motors) {
    if (motor.canId == canId) return &motor;
  }
  return nullptr;
}

static int32_t toMotorTarget(const MotorNode &motor, int32_t robotTarget) {
  return robotTarget * motor.direction;
}

static int32_t toMotorSpeed(const MotorNode &motor, int32_t robotRpm) {
  return robotRpm * motor.direction;
}

static void pauseEncoderPolling() {
  encoderPollingPausedUntilMs = millis() + MOTION_COMMAND_POLL_PAUSE_MS;
}

static bool sendDriverCommand(uint16_t canId, const uint8_t *cmd, uint8_t len) {
  pauseEncoderPolling();
  mks::waitTxIdle(5);
  for (uint8_t attempt = 0; attempt < CAN_COMMAND_TX_RETRIES; attempt++) {
    if (mks::sendFrame(canId, cmd, len)) return true;
    drainCanReplies();
    mks::waitTxIdle(2);
    delay(1);
  }
  return false;
}

