linuxhelp01/Esp32_paletizador/src/machine.cpp
int32_t degToEncoderCounts(float deg) {
  const float counts = deg * ENCODER_COUNTS_PER_DEG;
  if (counts > MAX_INT24) return MAX_INT24;
  if (counts < MIN_INT24) return MIN_INT24;
  return static_cast<int32_t>(roundf(counts));
}

float encoderCountsToMm(int64_t encoderCounts) {
  return static_cast<float>(encoderCounts) / ENCODER_COUNTS_PER_MM;
}

float encoderCountsToDeg(int64_t encoderCounts) {
  return static_cast<float>(encoderCounts) / ENCODER_COUNTS_PER_DEG;
}

float encoderCountsToRad(int64_t encoderCounts) {
  return encoderCountsToDeg(encoderCounts) * PI / 180.0f;
}

float motorPositionUnits(const MotorNode &motor) {
  return motor.rotaryAxis ? encoderCountsToDeg(motor.encoder) : encoderCountsToMm(motor.encoder);
}

float motorVelocityUnitsPerS(const MotorNode &motor) {
  return motor.velocityMmS;
}

float motorJointPosition(const MotorNode &motor) {
  return motor.rotaryAxis ? encoderCountsToRad(motor.encoder) : encoderCountsToMm(motor.encoder) / 1000.0f;
}

float motorJointVelocity(const MotorNode &motor) {
  return motor.rotaryAxis ? motor.velocityMmS * PI / 180.0f : motor.velocityMmS / 1000.0f;
}

const char *motorPositionUnit(const MotorNode &motor) {
  return motor.rotaryAxis ? "deg" : "mm";
}

uint16_t linearSpeedMmSToRpm(float speedMmS) {
  const float rpm = abs(speedMmS) * 60.0f / LEADSCREW_MM_PER_REV;
  return clampRpm(static_cast<int32_t>(roundf(rpm)));
}

uint16_t angularSpeedDegSToRpm(float speedDegS) {
  const float rpm = abs(speedDegS) / 6.0f;
  return clampRpm(static_cast<int32_t>(roundf(rpm)));
}

uint8_t angularAccelRpmSToMksAcc(float rpmPerS) {
  rpmPerS = abs(rpmPerS);
  if (rpmPerS <= 0.0f) return 0;

  // Manual MKS: cada incremento de 1 RPM ocurre cada (256 - acc) * 50 us.
  const float accValue = 256.0f - (20000.0f / rpmPerS);
  if (accValue < 1.0f) return 1;
  if (accValue > 255.0f) return 255;
  return static_cast<uint8_t>(roundf(accValue));
}

uint8_t linearAccelMmS2ToMksAcc(float mmPerS2) {
  const float rpmPerS = abs(mmPerS2) * 60.0f / LEADSCREW_MM_PER_REV;
  return angularAccelRpmSToMksAcc(rpmPerS);
}

uint8_t angularAccelDegS2ToMksAcc(float degPerS2) {
  const float rpmPerS = abs(degPerS2) / 6.0f;
  return angularAccelRpmSToMksAcc(rpmPerS);
}

static void encodeSpeed(int32_t signedRpm, uint8_t &speedHigh, uint8_t &speedLow) {
  const uint16_t rpm12 = clampRpm(signedRpm) & 0x0FFF;
  const uint8_t dirBit = signedRpm < 0 ? mks::DIR_NEGATIVE : mks::DIR_POSITIVE;
  speedHigh = ((rpm12 >> 8) & 0x0F) | dirBit;
  speedLow = rpm12 & 0xFF;
}

static bool commandSpeed(MotorNode &motor, int32_t rpm, uint8_t acc) {
  if (!motorIsCommandable(motor)) return false;

  uint8_t speedHigh = 0;
  uint8_t speedLow = 0;
  encodeSpeed(toMotorSpeed(motor, rpm), speedHigh, speedLow);
  const uint8_t cmd[] = {mks::CMD_RUN_SPEED, speedHigh, speedLow, acc};
  const bool ok = sendDriverCommand(motor.canId, cmd, sizeof(cmd));
  if (ok) motor.lastAcc = acc;
  return ok;
}

static bool commandEmergencyStop(MotorNode &motor) {
  const uint8_t cmd[] = {mks::CMD_EMERGENCY_STOP};
  return sendDriverCommand(motor.canId, cmd, sizeof(cmd));
}

static bool commandStopAll() {
  bool ok = true;
  for (MotorNode &motor : motors) {
    ok &= commandEmergencyStop(motor);
  }
  return ok;
}

bool stopAllMotors() {
  if (homing.active) {
    homing.active = false;
    homing.phase = HomingPhase::FAILED;
    snprintf(homing.stateText, sizeof(homing.stateText), "aborted:stop");
  }
  xPairMotionMonitoringActive = false;
  xPairExpectedDirection = 0;
  return commandStopAll();
}

bool safetyFaultIsActive() {
  return safetyFaultActive;
}

const char *safetyFaultText() {
  return safetyFaultReason;
}

bool motorIsOnline(const MotorNode &motor, uint32_t nowMs) {
  return motor.lastSeenMs > 0 && (nowMs - motor.lastSeenMs) <= MOTOR_ONLINE_TIMEOUT_MS;
}

static bool encoderSampleIsFresh(const MotorNode &motor, uint32_t nowMs) {
  return motor.encoderOk &&
         motor.lastEncoderUpdateMs > 0 &&
         (nowMs - motor.lastEncoderUpdateMs) <= POSITION_SAMPLE_MAX_AGE_MS;
}

void getAxisPositionsMm(float &xMm, float &yMm, float &zMm) {
  float xSumMm = 0.0f;
  uint8_t xSamples = 0;

  if (motors[0].encoderOk) {
    xSumMm += encoderCountsToMm(motors[0].encoder);
    xSamples++;
  }
  if (motors[1].encoderOk) {
    xSumMm += encoderCountsToMm(motors[1].encoder);
    xSamples++;
  }

  xMm = xSamples ? xSumMm / xSamples : 0.0f;
  yMm = motors[2].encoderOk ? encoderCountsToMm(motors[2].encoder) : 0.0f;
  zMm = motors[3].encoderOk ? encoderCountsToMm(motors[3].encoder) : 0.0f;
}

bool axisPositionsAreValid() {
  const uint32_t now = millis();
  return encoderSampleIsFresh(motors[0], now) &&
         encoderSampleIsFresh(motors[1], now) &&
         encoderSampleIsFresh(motors[2], now) &&
         encoderSampleIsFresh(motors[3], now);
}

bool isAtXYZMm(float xMm, float yMm, float zMm, float toleranceMm) {
  if (!axisPositionsAreValid()) return false;

  float currentX = 0.0f;
  float currentY = 0.0f;
  float currentZ = 0.0f;
  getAxisPositionsMm(currentX, currentY, currentZ);

  return fabsf(currentX - xMm) <= toleranceMm &&
         fabsf(currentY - yMm) <= toleranceMm &&
         fabsf(currentZ - zMm) <= toleranceMm;
}

bool isAtXYZAMmDeg(float xMm, float yMm, float zMm, bool useA, float aDeg, float toleranceMm, float angularToleranceDeg) {
  if (!isAtXYZMm(xMm, yMm, zMm, toleranceMm)) return false;
  if (!useA) return true;
  if (!motors[4].encoderOk) return false;
  const float currentA = motorPositionUnits(motors[4]);
  return fabsf(currentA - aDeg) <= angularToleranceDeg;
}

static bool commandConfigureHome(MotorNode &motor, uint16_t rpm) {
  rpm = clampRpm(rpm);
  const uint8_t cmd[] = {
    mks::CMD_SET_HOME_PARAMS,
    HOME_TRIGGER_LEVEL,
    homeDirectionForMotor(motor),
    static_cast<uint8_t>((rpm >> 8) & 0xFF),
    static_cast<uint8_t>(rpm & 0xFF),
    HOME_LIMIT_ENABLE,
    HOME_MODE_ORIGIN_SWITCH,
  };
  return sendDriverCommand(motor.canId, cmd, sizeof(cmd));
}

static bool commandHome(MotorNode &motor) {
  motor.homeStatus = 0;
  motor.homeCommandOk = false;
  motor.homeStatusSingleTurn = 0;
  motor.homeStatusOrigin = 0;
  motor.homeStatusOk = false;
  const uint8_t cmd[] = {mks::CMD_HOME, 0x00};
  return sendDriverCommand(motor.canId, cmd, sizeof(cmd));
}

static bool commandGoOrigin(MotorNode &motor) {
  if (!motorIsCommandable(motor)) return false;
  motor.homeStatus = 0;
  motor.homeCommandOk = false;
  motor.homeStatusSingleTurn = 0;
  motor.homeStatusOrigin = 0;
  motor.homeStatusOk = false;
  const uint8_t cmd[] = {mks::CMD_HOME, 0x01};
  return sendDriverCommand(motor.canId, cmd, sizeof(cmd));
}

