linuxhelp01/Esp32_paletizador/src/machine.cpp
static bool commandSetZero(MotorNode &motor) {
  if (!motorIsCommandable(motor)) return false;
  const uint8_t cmd[] = {mks::CMD_SET_ZERO};
  return sendDriverCommand(motor.canId, cmd, sizeof(cmd));
}

static bool commandSetEnable(MotorNode &motor, bool enable) {
  const uint8_t cmd[] = {mks::CMD_SET_ENABLE, static_cast<uint8_t>(enable ? 0x01 : 0x00)};
  const bool ok = sendDriverCommand(motor.canId, cmd, sizeof(cmd));
  if (ok) {
    motor.enableCommandStatus = 0;
    motor.enabledOk = false;
  }
  return ok;
}

static bool commandReleaseStall(MotorNode &motor) {
  const uint8_t cmd[] = {mks::CMD_RELEASE_STALL};
  const bool ok = sendDriverCommand(motor.canId, cmd, sizeof(cmd));
  if (ok) motor.stallOk = false;
  return ok;
}

static void setHomingText(const char *phase, Axis axis) {
  snprintf(homing.stateText, sizeof(homing.stateText), "%s:%s", phase, axisName(axis));
}

static bool configureHomingAxes(Axis axis) {
  homing.axisCount = 0;
  homing.axisIndex = 0;
  if (axis == Axis::ALL) {
    homing.axes[0] = Axis::X;
    homing.axes[1] = Axis::Y;
    homing.axes[2] = Axis::Z;
    homing.axisCount = 3;
    return true;
  }
  if (axis == Axis::X || axis == Axis::Y || axis == Axis::Z || axis == Axis::A) {
    homing.axes[0] = axis;
    homing.axisCount = 1;
    return true;
  }
  return false;
}

static bool homingAxisHasFailure(Axis axis) {
  bool failed = false;
  forEachMotorInAxis(axis, [&failed](MotorNode &motor) {
    if (motor.homeStatus == 0 && motor.homeCommandOk) failed = true;
    if (motor.homeStatusOrigin == 2 && motor.homeStatusOk) failed = true;
    return true;
  });
  return failed;
}

static bool homingAxisIsComplete(Axis axis) {
  bool complete = true;
  forEachMotorInAxis(axis, [&complete](MotorNode &motor) {
    const bool commandComplete = motor.homeCommandOk && motor.homeStatus == 2;
    const bool originComplete = motor.homeStatusOk && motor.homeStatusOrigin == 1;
    complete &= commandComplete || originComplete;
    return true;
  });
  return complete;
}

static void failHoming(const char *reason) {
  homing.active = false;
  homing.phase = HomingPhase::FAILED;
  snprintf(homing.stateText, sizeof(homing.stateText), "failed:%s", reason);
  xPairMotionMonitoringActive = false;
  xPairExpectedDirection = 0;
  commandStopAll();
}

static void finishCurrentHomingAxis() {
  const Axis axis = currentHomingAxis();
  forEachMotorInAxis(axis, [](MotorNode &motor) {
    const uint8_t readEncoder[] = {mks::CMD_READ_ENCODER};
    const uint8_t readRaw[] = {mks::CMD_READ_RAW_ENCODER};
    mks::sendFrame(motor.canId, readEncoder, sizeof(readEncoder));
    mks::sendFrame(motor.canId, readRaw, sizeof(readRaw));
    return true;
  });

  if (homing.configureLimits && homing.axisCount == 1) {
    setAxisLimits(axis, homing.limitMinMm, homing.limitMaxMm);
  }

  homing.axisIndex++;
  if (homing.axisIndex >= homing.axisCount) {
    homing.active = false;
    homing.phase = HomingPhase::COMPLETE;
    snprintf(homing.stateText, sizeof(homing.stateText), "complete:%s", axisName(homing.requestedAxis));
    clearXPairExpectedDirectionIfAxis(axis);
    return;
  }

  homing.phase = HomingPhase::CONFIG_FAST;
  homing.phaseStartedMs = millis();
  setHomingText("config_fast", currentHomingAxis());
}

bool startHomeAxis(Axis axis, bool configureLimits, float minMm, float maxMm, uint16_t fastRpm, uint16_t slowRpm) {
  if (homing.active) return false;
  if (!safetyAllowsMotion()) return false;
  if (!configureHomingAxes(axis)) return false;
  if (configureLimits && homing.axisCount != 1) return false;
  if (configureLimits && !(minMm < maxMm)) return false;

  for (uint8_t i = 0; i < homing.axisCount; i++) {
    if (!axisIsEnabledAndClear(homing.axes[i])) return false;
    if (homing.axes[i] == Axis::X && !isXPairAligned()) return false;
  }

  homing.active = true;
  homing.requestedAxis = axis;
  homing.phase = HomingPhase::CONFIG_FAST;
  homing.fastRpm = fastRpm > 0 ? clampRpm(fastRpm) : HOME_FAST_RPM;
  homing.slowRpm = slowRpm > 0 ? clampRpm(slowRpm) : HOME_SLOW_RPM;
  homing.configureLimits = configureLimits;
  homing.limitMinMm = minMm;
  homing.limitMaxMm = maxMm;
  homing.phaseStartedMs = millis();
  setHomingText("config_fast", currentHomingAxis());
  if (axis == Axis::X) {
    xPairMotionMonitoringActive = true;
    xPairExpectedDirection = 0;
  }
  return true;
}

bool commandGoOriginAxis(Axis axis) {
  if (!safetyAllowsMotion() || homing.active) return false;
  if (axis == Axis::X1 || axis == Axis::X2 || axis == Axis::UNKNOWN) return false;
  if (!axisIsEnabledAndClear(axis)) return false;
  if (axis == Axis::X && !isXPairAligned()) return false;
  if (axis == Axis::ALL && !isXPairAligned()) return false;
  return forEachMotorInAxis(axis, [](MotorNode &motor) {
    return commandGoOrigin(motor);
  });
}

bool commandSetZeroAxis(Axis axis, bool configureLimits, float minMm, float maxMm) {
  if (!safetyAllowsMotion() || homing.active) return false;
  if (axis == Axis::X1 || axis == Axis::X2 || axis == Axis::ALL || axis == Axis::UNKNOWN) return false;
  if (axis == Axis::A && configureLimits) return false;
  if (configureLimits && !setAxisLimits(axis, minMm, maxMm)) return false;
  if (!axisIsEnabledAndClear(axis)) return false;
  if (axis == Axis::X && !isXPairAligned()) return false;
  return forEachMotorInAxis(axis, [](MotorNode &motor) {
    return commandSetZero(motor);
  });
}

bool commandSetAxisLimits(Axis axis, float minMm, float maxMm) {
  if (axis == Axis::ALL || axis == Axis::A || axis == Axis::X1 || axis == Axis::X2 || axis == Axis::UNKNOWN) return false;
  return setAxisLimits(axis, minMm, maxMm);
}

bool commandSetAxisEnable(Axis axis, bool enable) {
  if (axis == Axis::UNKNOWN) return false;
  if (enable && safetyFaultActive) return false;
  if (!enable) {
    if (homing.active) {
      homing.active = false;
      homing.phase = HomingPhase::FAILED;
      snprintf(homing.stateText, sizeof(homing.stateText), "aborted:disable");
    }
    clearXPairExpectedDirectionIfAxis(axis);
  }
  return forEachMotorInAxis(axis, [enable](MotorNode &motor) {
    return commandSetEnable(motor, enable);
  });
}

