linuxhelp01/Esp32_paletizador/src/machine.cpp
  motor.rawEncoder = value;
  motor.previousEncoder = motor.encoder;
  motor.encoder = value * motor.direction;
  motor.encoderOk = true;
  motor.lastEncoderUpdateMs = now;
  motor.lastSeenMs = motor.lastEncoderUpdateMs;
  verifyXPairDirectionSafety();
}

static void handleSpeedReply(MotorNode &motor, const twai_message_t &msg) {
  if (msg.data_length_code < 4) return;

  const int16_t rawRpm = static_cast<int16_t>((static_cast<uint16_t>(msg.data[1]) << 8) | msg.data[2]);
  motor.rpm = rawRpm * motor.direction;
  motor.rpmOk = true;
  motor.lastSeenMs = millis();
}

static void handleRawEncoderReply(MotorNode &motor, const twai_message_t &msg) {
  if (msg.data_length_code < 8) return;

  int64_t value = 0;
  for (uint8_t i = 1; i <= 6; i++) {
    value = (value << 8) | msg.data[i];
  }
  if (value & 0x0000800000000000LL) {
    value |= 0xFFFF000000000000LL;
  }

  motor.diagnosticRawEncoder = value * motor.direction;
  motor.rawEncoderOk = true;
  motor.lastRawEncoderUpdateMs = millis();
  motor.lastSeenMs = motor.lastRawEncoderUpdateMs;
}

static void handleAngleErrorReply(MotorNode &motor, const twai_message_t &msg) {
  if (msg.data_length_code >= 6) {
    motor.angleError =
        (static_cast<int32_t>(msg.data[1]) << 24) |
        (static_cast<int32_t>(msg.data[2]) << 16) |
        (static_cast<int32_t>(msg.data[3]) << 8) |
        static_cast<int32_t>(msg.data[4]);
  } else if (msg.data_length_code >= 4) {
    motor.angleError = static_cast<int16_t>((static_cast<uint16_t>(msg.data[1]) << 8) | msg.data[2]);
  } else {
    return;
  }
  motor.angleErrorOk = true;
  motor.lastSeenMs = millis();
}

static void handleEnableReply(MotorNode &motor, const twai_message_t &msg) {
  if (msg.data_length_code < 3) return;
  motor.enabled = msg.data[1] != 0;
  motor.enabledOk = true;
  motor.lastSeenMs = millis();
}

static void handleHomeStatusReply(MotorNode &motor, const twai_message_t &msg) {
  if (msg.data_length_code < 4) return;
  motor.homeStatusSingleTurn = msg.data[1];
  motor.homeStatusOrigin = msg.data[2];
  motor.homeStatusOk = true;
  motor.lastSeenMs = millis();
}

static void handleStallReply(MotorNode &motor, const twai_message_t &msg) {
  if (msg.data_length_code < 3) return;
  motor.stalled = msg.data[1] != 0;
  motor.stallOk = true;
  motor.lastSeenMs = millis();
}

static void handleStatusReply(MotorNode &motor, const twai_message_t &msg) {
  if (msg.data_length_code < 3) return;
  const uint8_t code = msg.data[0];
  const uint8_t status = msg.data[1];

  if (code == mks::CMD_HOME) {
    motor.homeStatus = status;
    motor.homeCommandOk = true;
  } else if (code == mks::CMD_SET_ENABLE) {
    motor.enableCommandStatus = status;
    if (status == 1) {
      motor.enabledOk = false;
    }
  } else if (code == mks::CMD_RUN_ABS_COORD || code == mks::CMD_RUN_SPEED || code == mks::CMD_EMERGENCY_STOP) {
    motor.moveStatus = status;
  }
  motor.lastSeenMs = millis();
}

void drainCanReplies() {
  twai_message_t rx = {};
  uint8_t replies = 0;
  while (replies < CAN_MAX_REPLIES_PER_CONTROL_CYCLE && mks::readAnyFrame(rx, 0)) {
    replies++;
    MotorNode *motor = findMotorById(rx.identifier);
    if (!motor) continue;
    if (!mks::verifyChecksum(rx)) continue;

    switch (rx.data[0]) {
      case mks::CMD_READ_ENCODER:
        handleEncoderReply(*motor, rx);
        break;
      case mks::CMD_READ_SPEED_RPM:
        handleSpeedReply(*motor, rx);
        break;
      case mks::CMD_READ_RAW_ENCODER:
        handleRawEncoderReply(*motor, rx);
        break;
      case mks::CMD_READ_ANGLE_ERROR:
        handleAngleErrorReply(*motor, rx);
        break;
      case mks::CMD_READ_ENABLE:
        handleEnableReply(*motor, rx);
        break;
      case mks::CMD_READ_HOME_STATUS:
        handleHomeStatusReply(*motor, rx);
        break;
      case mks::CMD_READ_STALL:
        handleStallReply(*motor, rx);
        break;
      case mks::CMD_RUN_ABS_COORD:
      case mks::CMD_RUN_SPEED:
      case mks::CMD_EMERGENCY_STOP:
      case mks::CMD_HOME:
      case mks::CMD_SET_ZERO:
      case mks::CMD_SET_MODE:
      case mks::CMD_SET_ENABLE:
      case mks::CMD_SET_HOME_PARAMS:
      case mks::CMD_RELEASE_STALL:
        handleStatusReply(*motor, rx);
        break;
      default:
        motor->lastSeenMs = millis();
        break;
    }
  }
}

static bool encoderSlotAllowsMotor(uint8_t slot, uint8_t motorIndex, uint32_t now) {
  if (motorIndex >= ROBOT_MOTOR_COUNT) return false;
  if (motorIndex != 4) return true;
  if (!ENCODER_SLOT_A_REQUIRES_ACTIVITY[slot]) return true;
  return motorIsTelemetryActive(motors[4], now);
}

static void pollScheduledEncoders(uint32_t now, CanPollBudget &budget) {
  const uint8_t slot = static_cast<uint8_t>(now % CAN_POLL_SLOT_COUNT);
  for (uint8_t i = 0; i < ENCODER_SLOT_WIDTH; i++) {
    const uint8_t motorIndex = ENCODER_POLL_SLOTS[slot][i];
    if (motorIndex == NO_MOTOR_SLOT || !budget.available()) continue;
    if (!encoderSlotAllowsMotor(slot, motorIndex, now)) continue;
    if (budget.request(requestEncoder, motors[motorIndex])) {
      lastEncoderPollMs[motorIndex] = now;
    }
  }
}

void pollEncoders() {
  const uint32_t now = millis();
  if (static_cast<int32_t>(now - encoderPollingPausedUntilMs) < 0) return;

  CanPollBudget budget;
  pollScheduledEncoders(now, budget);

  if (budget.available() && now - lastSpeedPollMs >= SPEED_POLL_MS) {
    lastSpeedPollMs = now;
    if (budget.request(requestSpeed, motors[nextSpeedPollMotor])) {
      nextSpeedPollMotor = (nextSpeedPollMotor + 1) % ROBOT_MOTOR_COUNT;
    }
  }

  if (budget.available() && homing.active && now - lastHomeStatusPollMs >= HOME_STATUS_POLL_MS) {
    lastHomeStatusPollMs = now;
    const Axis axis = currentHomingAxis();
    forEachMotorInAxis(axis, [&budget](MotorNode &motor) {
      if (!budget.available()) return false;
      budget.request(requestHomeStatus, motor);
      return true;
    });
  }

  if (budget.available() && !homing.active && now - lastRawEncoderPollMs >= RAW_ENCODER_DIAGNOSTIC_POLL_MS) {
    lastRawEncoderPollMs = now;
    if (budget.request(requestRawEncoder, motors[nextRawEncoderPollMotor])) {
      nextRawEncoderPollMotor = (nextRawEncoderPollMotor + 1) % ROBOT_MOTOR_COUNT;
    }
  }

  if (budget.available() && now - lastAngleErrorPollMs >= ANGLE_ERROR_POLL_MS) {
    lastAngleErrorPollMs = now;
    if (budget.request(requestAngleError, motors[nextAngleErrorPollMotor])) {
      nextAngleErrorPollMotor = (nextAngleErrorPollMotor + 1) % ROBOT_MOTOR_COUNT;
    }
  }

  if (budget.available() && now - lastEnableStatusPollMs >= ENABLE_STATUS_POLL_MS) {
    lastEnableStatusPollMs = now;
    if (budget.request(requestEnableStatus, motors[nextEnablePollMotor])) {
      nextEnablePollMotor = (nextEnablePollMotor + 1) % ROBOT_MOTOR_COUNT;
    }
  }

