linuxhelp01/Esp32_paletizador/src/machine.cpp
static void writeAuxServoPulse(uint16_t pulseUs) {
  ensureAuxServoAttached();
  auxServo.writeMicroseconds(pulseUs);
}

bool commandSetAuxServoPulseUs(uint16_t pulseUs) {
  if (pulseUs < AUX_SERVO_MIN_US) pulseUs = AUX_SERVO_MIN_US;
  if (pulseUs > AUX_SERVO_MAX_US) pulseUs = AUX_SERVO_MAX_US;
  auxServoPulseUs = pulseUs;
  auxServoAngleDeg = AUX_SERVO_MIN_DEG +
                     (static_cast<float>(pulseUs - AUX_SERVO_MIN_US) *
                      (AUX_SERVO_MAX_DEG - AUX_SERVO_MIN_DEG) /
                      static_cast<float>(AUX_SERVO_MAX_US - AUX_SERVO_MIN_US));
  auxServoEnabled = true;
  writeAuxServoPulse(auxServoPulseUs);
  return true;
}

bool commandSetAuxServoAngle(float angleDeg) {
  if (angleDeg < AUX_SERVO_MIN_DEG) angleDeg = AUX_SERVO_MIN_DEG;
  if (angleDeg > AUX_SERVO_MAX_DEG) angleDeg = AUX_SERVO_MAX_DEG;
  const float spanUs = static_cast<float>(AUX_SERVO_MAX_US - AUX_SERVO_MIN_US);
  const float spanDeg = AUX_SERVO_MAX_DEG - AUX_SERVO_MIN_DEG;
  const uint16_t pulseUs = static_cast<uint16_t>(roundf(AUX_SERVO_MIN_US + ((angleDeg - AUX_SERVO_MIN_DEG) * spanUs / spanDeg)));
  return commandSetAuxServoPulseUs(pulseUs);
}

static void serviceAuxServoTestSweep() {
  if (!AUX_SERVO_TEST_SWEEP_ENABLED) return;

  const uint32_t now = millis();
  if (lastAuxServoTestSweepMs != 0 && now - lastAuxServoTestSweepMs < AUX_SERVO_TEST_SWEEP_PERIOD_MS) return;

  lastAuxServoTestSweepMs = now;
  auxServoTestSweepHigh = !auxServoTestSweepHigh;
  commandSetAuxServoAngle(auxServoTestSweepHigh ? AUX_SERVO_MAX_DEG : AUX_SERVO_MIN_DEG);
}

bool commandDisableAuxServo() {
  if (auxServoAttached) {
    auxServo.detach();
    auxServoAttached = false;
  }
  auxServoEnabled = false;
  return true;
}

bool getAuxServoState(bool &enabled, uint16_t &pulseUs, float &angleDeg) {
  enabled = auxServoEnabled;
  pulseUs = auxServoPulseUs;
  angleDeg = auxServoAngleDeg;
  return true;
}

static void reportCommandResult(const char *label, bool ok) {
  DebugSerial.print(label);
  DebugSerial.println(ok ? " OK" : " ERROR");
}

void handleMachineCommand(String line) {
  String command = nextToken(line);
  command.toUpperCase();

  if (command == "HELP" || command == "?") {
    printHelp();
    return;
  }

  if (command == "HELLO") {
    DebugSerial.println("PALLETIZER_LINK_OK");
    return;
  }

  if (command == "STATUS") {
    printStatus();
    return;
  }

  if (command == "FAULT") {
    String subCommand = nextToken(line);
    subCommand.toUpperCase();
    if (subCommand == "STATUS" || subCommand.length() == 0) {
      DebugSerial.print("SAFETY ");
      DebugSerial.print(safetyFaultActive ? "FAULT " : "OK ");
      DebugSerial.println(safetyFaultReason);
      return;
    }
    if (subCommand == "RESET") {
      reportCommandResult("FAULT RESET", resetSafetyFault());
      return;
    }
    if (subCommand == "TEST") {
      setSafetyFault("test manual de seguridad del eje X doble");
      reportCommandResult("FAULT TEST", safetyFaultActive);
      return;
    }
    DebugSerial.println("FAULT ERROR: usa FAULT STATUS, FAULT RESET o FAULT TEST.");
    return;
  }

  if (command == "PING") {
    bool ok = true;
    for (const MotorNode &motor : motors) {
      ok &= requestEncoder(motor);
      ok &= requestSpeed(motor);
      ok &= requestRawEncoder(motor);
      ok &= requestAngleError(motor);
      ok &= requestEnableStatus(motor);
      ok &= requestHomeStatus(motor);
      ok &= requestStallStatus(motor);
      delay(5);
    }
    reportCommandResult("PING", ok);
    return;
  }

  if (command == "SYNC") {
    const bool enable = nextToken(line).toInt() != 0;
    reportCommandResult("SYNC", commandEnableSyncBroadcast(enable));
    return;
  }

  if (command == "TRIGGER") {
    reportCommandResult("TRIGGER", commandSyncTrigger());
    return;
  }

  if (command == "STOP") {
    xPairMotionMonitoringActive = false;
    xPairExpectedDirection = 0;
    reportCommandResult("STOP", commandStopAll());
    return;
  }

  if (command == "VEL") {
    Axis axis = parseAxis(nextToken(line));
    int32_t rpm = nextToken(line).toInt();
    uint8_t acc = line.length() ? clampAcc(nextToken(line).toInt()) : DEFAULT_ACC;
    if (!axisIsSafeForMotion(axis) || axisLimitsAreConfigured(axis) || homing.active) {
      reportCommandResult("VEL", false);
      return;
    }

    if (axis == Axis::X) setXPairExpectedDirectionFromSpeed(rpm);
    bool ok = commandPrepareSynchronizedMove();
    ok &= forEachMotorInAxis(axis, [rpm, acc](MotorNode &motor) {
      return commandSpeed(motor, rpm, acc);
    });
    if (ok) ok &= commandSyncTrigger();
    if (!ok) clearXPairExpectedDirectionIfAxis(axis);
    reportCommandResult("VEL", ok);
    return;
  }

  if (command == "VELANG") {
    Axis axis = parseAxis(nextToken(line));
    int32_t rpm = nextToken(line).toInt();
    uint8_t acc = line.length() ? angularAccelRpmSToMksAcc(nextToken(line).toFloat()) : DEFAULT_ACC;
    if (!axisIsSafeForMotion(axis) || axisLimitsAreConfigured(axis) || homing.active) {
      reportCommandResult("VELANG", false);
      return;
    }

    if (axis == Axis::X) setXPairExpectedDirectionFromSpeed(rpm);
    bool ok = commandPrepareSynchronizedMove();
    ok &= forEachMotorInAxis(axis, [rpm, acc](MotorNode &motor) {
      return commandSpeed(motor, rpm, acc);
    });
    if (ok) ok &= commandSyncTrigger();
    if (!ok) clearXPairExpectedDirectionIfAxis(axis);
    reportCommandResult("VELANG", ok);
    return;
  }

  if (command == "POS") {
    Axis axis = parseAxis(nextToken(line));
    int32_t target = nextToken(line).toInt();
    uint16_t rpm = line.length() ? clampRpm(nextToken(line).toInt()) : DEFAULT_RPM;
    uint8_t acc = line.length() ? clampAcc(nextToken(line).toInt()) : DEFAULT_ACC;
    if (!axisIsSafeForMotion(axis)) {
      reportCommandResult("POS", false);
      return;
    }

    if (axis == Axis::X) setXPairExpectedDirectionFromTarget(target);
    bool ok = commandPrepareSynchronizedMove();
    ok &= forEachMotorInAxis(axis, [target, rpm, acc](MotorNode &motor) {
      return commandAbsolutePosition(motor, target, rpm, acc);
    });
    if (ok) ok &= commandSyncTrigger();
    if (!ok) clearXPairExpectedDirectionIfAxis(axis);
    reportCommandResult("POS", ok);
    return;
  }

